Page({

  /**
   * 页面的初始数据
   */
  data: {
    articleList: [
      {
        title: '路飞与女帝不得不说的故事',
        content: '啊沙发大是大非阿打算发啊阿萨德发啊啊士大夫asd阿萨德发阿飞撒 阿斯顿发生阿飞阿萨德发阿飞阿飞阿飞sad',
        url: ''
      },
      {
        title: '娜美与路飞',
        content: '卡萨还非得话就是肯定飞hj阿萨德发asd啊阿斯顿发斯蒂芬阿斯顿发斯蒂芬ashdfl按时电话费',
        url: ''
      },
      {
        title: '索隆与山治的一夜',
        content: '阿萨德发电饭锅和电饭锅和是大法官是大法官是大法官是大法和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电官电饭锅和电饭锅和电饭锅和电饭锅和是大法官梵蒂冈和电饭锅和规划局可复活节课电饭锅和',
        url: ''
      },{
        title: '路飞与女帝不得不说的故事',
        content: '啊沙发大是大非阿打算发啊阿萨德发啊啊士大夫asd阿萨德发阿飞撒 阿斯顿发生阿飞阿萨德发阿飞阿飞阿飞sad',
        url: ''
      },
      {
        title: '娜美与路飞',
        content: '卡萨还非得话就是肯定飞hj阿萨德发asd啊阿斯顿发斯蒂芬阿斯顿发斯蒂芬ashdfl按时电话费',
        url: ''
      },
      {
        title: '索隆与山治的一夜',
        content: '阿萨德发电饭锅和电饭锅和是大法官是大法官是大法官是大法和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电官电饭锅和电饭锅和电饭锅和电饭锅和是大法官梵蒂冈和电饭锅和规划局可复活节课电饭锅和',
        url: ''
      },{
        title: '路飞与女帝不得不说的故事',
        content: '啊沙发大是大非阿打算发啊阿萨德发啊啊士大夫asd阿萨德发阿飞撒 阿斯顿发生阿飞阿萨德发阿飞阿飞阿飞sad',
        url: ''
      },
      {
        title: '娜美与路飞',
        content: '卡萨还非得话就是肯定飞hj阿萨德发asd啊阿斯顿发斯蒂芬阿斯顿发斯蒂芬ashdfl按时电话费',
        url: ''
      },
      {
        title: '索隆与山治的一夜',
        content: '阿萨德发电饭锅和电饭锅和是大法官是大法官是大法官是大法和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电官电饭锅和电饭锅和电饭锅和电饭锅和是大法官梵蒂冈和电饭锅和规划局可复活节课电饭锅和',
        url: ''
      },{
        title: '路飞与女帝不得不说的故事',
        content: '啊沙发大是大非阿打算发啊阿萨德发啊啊士大夫asd阿萨德发阿飞撒 阿斯顿发生阿飞阿萨德发阿飞阿飞阿飞sad',
        url: ''
      },
      {
        title: '娜美与路飞',
        content: '卡萨还非得话就是肯定飞hj阿萨德发asd啊阿斯顿发斯蒂芬阿斯顿发斯蒂芬ashdfl按时电话费',
        url: ''
      },
      {
        title: '索隆与山治的一夜',
        content: '阿萨德发电饭锅和电饭锅和是大法官是大法官是大法官是大法和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电和是大法官是大法官是大法官是大法官电饭锅和电饭锅和电官电饭锅和电饭锅和电饭锅和电饭锅和是大法官梵蒂冈和电饭锅和规划局可复活节课电饭锅和',
        url: ''
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  toArticle: function () {
    wx: wx.navigateTo({
      url: '../article/article',
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})