Page({

  /**
   * 页面的初始数据
   */
  data: {
    title: '路飞与女帝不得不说的故事',
    author: ' 妮可.罗宾',
    time: '2018-01-31',
    content: '和女帝分开后，路飞就去大闹推进城，放了好多罪犯，中了推进城署长的毒。Mr·2找到了叛乱军伊娃和闪电，还有克罗克达尔（原王下七武海）和甚平（现任王下七武海）一起去救路飞的哥哥艾斯，当然，到了行刑场的时候白胡子与他的部下也来营救艾斯了，（中间部分省略，就是在战斗啦）白胡子最终被黑胡子杀死，艾斯被熔岩果实的大将赤犬杀死，路飞受不了失去哥哥的打击而崩溃，这时，甚平，女帝救了路飞把他带往九蛇岛，在这其中一直是特拉法尔加·罗 （十一超新星）在治疗路飞和甚平。接下来是讲小时候的路飞被爷爷带到山贼达旦家，结识了同样是被爷爷寄养在达旦家的海贼王哥而·D·罗杰的儿子——艾斯，和从贵族家逃跑的萨博。三人结为了兄弟。萨博在环境的压迫下，十分早就出了海，但是船被路过的天龙人，给烧毁了（不知道死没死），十年后，17岁的艾斯出海了。接下来，三年后，路飞也出海了，一击击败了当年吃了香克斯的手臂的海霸王。和女帝分开后，路飞就去大闹推进城，放了好多罪犯，中了推进城署长的毒。Mr·2找到了叛乱军伊娃和闪电，还有克罗克达尔（原王下七武海）和甚平（现任王下七武海）一起去救路飞的哥哥艾斯，当然，到了行刑场的时候白胡子与他的部下也来营救艾斯了，（中间部分省略，就是在战斗啦）白胡子最终被黑胡子杀死，艾斯被熔岩果实的大将赤犬杀死，路飞受不了失去哥哥的打击而崩溃，这时，甚平，女帝救了路飞把他带往九蛇岛，在这其中一直是特拉法尔加·罗 （十一超新星）在治疗路飞和甚平。接下来是讲小时候的路飞被爷爷带到山贼达旦家，结识了同样是被爷爷寄养在达旦家的海贼王哥而·D·罗杰的儿子——艾斯，和从贵族家逃跑的萨博。三人结为了兄弟。萨博在环境的压迫下，十分早就出了海，但是船被路过的天龙人，给烧毁了（不知道死没死），十年后，17岁的艾斯出海了。接下来，三年后，路飞也出海了，一击击败了当年吃了香克斯的手臂的海霸王。和女帝分开后，路飞就去大闹推进城，放了好多罪犯，中了推进城署长的毒。Mr·2找到了叛乱军伊娃和闪电，还有克罗克达尔（原王下七武海）和甚平（现任王下七武海）一起去救路飞的哥哥艾斯，当然，到了行刑场的时候白胡子与他的部下也来营救艾斯了，（中间部分省略，就是在战斗啦）白胡子最终被黑胡子杀死，艾斯被熔岩果实的大将赤犬杀死，路飞受不了失去哥哥的打击而崩溃，这时，甚平，女帝救了路飞把他带往九蛇岛，在这其中一直是特拉法尔加·罗 （十一超新星）在治疗路飞和甚平。接下来是讲小时候的路飞被爷爷带到山贼达旦家，结识了同样是被爷爷寄养在达旦家的海贼王哥而·D·罗杰的儿子——艾斯，和从贵族家逃跑的萨博。三人结为了兄弟。萨博在环境的压迫下，十分早就出了海，但是船被路过的天龙人，给烧毁了（不知道死没死），十年后，17岁的艾斯出海了。接下来，三年后，路飞也出海了，一击击败了当年吃了香克斯的手臂的海霸王。',
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})